app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def search
    if params[:search].present?
      @movies = Movie.search(params[:search])

INSERT INTO "movies" ("created_at", "description", "director", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "movie_length", "rating", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = current_user.movies.build(params[:movie])

    respond_to do |format|
      if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "movies" SET "title" = 'Jurasic world', "image_file_name" = 'JP.jpeg', "image_content_type" = 'image/jpeg', "image_file_size" = 9622, "image_updated_at" = '2015-06-30 02:01:46.832101', "updated_at" = '2015-06-30 02:01:46.933523' WHERE "movies"."id" = 2
---
  def update
    @movie = Movie.find(params[:id])

    respond_to do |format|
      if @movie.update_attributes(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (1)
---
    def set_movie
      @movie = Movie.find(params[:id])